[
  {
    "_id": "5eb5f9a5d814a9f2d2b0ced5",
    "index": 0,
    "type": "cake",
    "source": "/Design/lemoncake.png",
    "recipes": {
      "name": "Lemon Cake",
      "recipe": " Heat oven to 180C/fan 160C/gas 4 Beat together 225g softened unsalted butter and 225g caster sugar until pale and creamy, then add 4 eggs, one at a time, slowly mixing through. Sift in 225g self-raising flour, then add the finely grated zest of 1 lemon and mix until well combined.Line a loaf tin (8 x 21cm) with greaseproof paper, then spoon in the mixture and level the top with a spoon.Bake for 45-50 mins until a thin skewer inserted into the centre of the cake comes out clean. While the cake is cooling in its tin, mix together the juice of 1 ½ lemons and 85g caster sugar to make the drizzle. Prick the warm cake all over with a skewer or fork, then pour over the drizzle – the juice will sink in and the sugar will form a lovely, crisp topping.Leave in the tin until completely cool, then remove and serve. Will keep in an airtight container for 3-4 days, or freeze for up to 1 month.",
      "ingredients": "225g unsalted butter, softened, 225g caster sugar, 4 eggs, 225g self-raising flour, finely grated zest 1 lemon"
    }
  },
  {
    "_id": "5eb5f9a509c7655a7ebb5d15",
    "index": 1,
    "type": "cake",
    "recipes": {
      "name": "Strewberry Cake",
      "recipe": " Butter and line the bases of three 18cm cake tins. Heat the oven to 180C/160C fan/gas 4. Blend the butter and sugar in a food processor until smooth and creamy. Add the eggs, flour and yogurt and blend again. Add 200g strawberries (save the best ones to decorate) and the vanilla. Blend once more, until the mixture is well combined. Divide the cake batter evenly between the three cake tins. Spread and smooth the tops with a spatula, then bake for 25-30 mins, until the cakes have risen and a skewer inserted into the centre comes out clean. Return to the oven for another 5 mins if any wet mixture clings to the skewer. Leave in the tins for 5 mins, then turn onto a wire rack and leave to cool completely. The cakes can be made up to two days before icing, or frozen for two months. For the icing, blend the butter and half the sugar until smooth and creamy, add the soft cheese and the remaining sugar and blend again. Be careful not to over mix as the icing will become runny. (If you do overmix, don’t worry – keep mixing with an electric whisk and it’ll thicken back up). Layer the cakes with the jam and half the icing. Invert the final cake on top, so the base of the cake it now the top, giving you a flat surface. Pile the rest of the icing on top of the cake, using a palette knife to spread the icing over the top and down the sides. Save a little icing to pipe rosettes around the edge of the cake, if you like. Top with the remaining strawberries. Can be made up to a day ahead of serving, keep somewhere cool or in the fridge. Will keep for three days. ",
      "ingredients": "400g softened butter, 400g caster sugar, 5 large eggs, 400g self-raising flour, 100ml natural yogurt, 300g strawberries, hulled and halved, 2 tsp vanilla extract"
    }
  },
  {
    "_id": "5eb5f9a579e7cf43a3dfd49b",
    "index": 2,
    "type": "cake",
    "recipes": {
      "name": "Cheesecake",
      "recipe": " Position an oven shelf in the middle of the oven. Heat the oven to 180C/ 160C fan/ gas 4. Line the base of a 23cm springform cake tin by putting a square piece of parchment paper or foil on top of the tin base and then clipping the side on so the paper or foil is trapped and any excess sticks out of the bottom. For the crust, melt 85g butter in a medium pan. Stir in 140g digestive biscuit crumbs and 1 tbsp golden caster or granulated sugar so the mixture is evenly moistened. Press the mixture into the bottom of the pan and bake for 10 minutes. Cool on a wire rack while preparing the filling. For the filling, increase the oven temperature to fan 220C/ 200C fan/ gas 7. In a table top mixer fitted with the paddle attachment, beat 900g full-fat soft cheese at medium-low speed until creamy, about 2 minutes. With the mixer on low, gradually add 250g golden caster sugar, then 3 tbsp plain flour and a pinch of salt, scraping down the sides of the bowl and the paddle twice. Swap the paddle attachment for the whisk. Continue by adding 1½ tsp vanilla extract, 2 tsp lemon zest and 1½ tsp lemon juice. Whisk in 3 large eggs and 1 yolk, one at a time, scraping the bowl and whisk at least twice. Stir a 284ml carton of soured cream until smooth, then measure 200ml (just over ¾ of the carton). Continue on low speed as you add the measured soured cream (reserve the rest). Whisk to blend, but don't over-beat. The batter should be smooth, light and somewhat airy. Brush the sides of the springform tin with melted butter and put on a baking sheet. Pour in the filling - if there are any lumps, sink them using a knife - the top should be as smooth as possible. Bake for 10 minutes. Reduce oven temperature to 110C/ 90C fan/ gas ¼ and bake for 45 minutes more. If you gently shake the tin, the filling should have a slight wobble. Turn off the oven and open the oven door for a cheesecake that's creamy in the centre, or leave it closed if you prefer a drier texture. Let cool in the oven for 2 hours. The cheesecake may get a slight crack on top as it cools. Combine the reserved soured cream with a 142ml carton soured cream, 1 tbsp golden caster sugar and 2 tsp lemon juice for the topping. Spread over the cheesecake right to the edges. Cover loosely with foil and refrigerate for at least 8 hours or overnight. Run a round-bladed knife around the sides of the tin to loosen any stuck edges. Unlock the side, slide the cheesecake off the bottom of the tin onto a plate, then slide the parchment paper out from underneath.",
      "ingredients": "225g unsalted butter, softened, 225g caster sugar, 4 eggs, 225g self-raising flour, finely grated zest 1 lemon; 900g Philadelphia cheese, or other full-fat soft cheese, 250g golden caster sugar, 3 tbsp plain flour, 1½ tsp vanilla extract, finely grated zest of 1 lemon (about 2 tsp), 1½ tsp lemon juice, 3 large eggs, plus 1 yolk, 284ml carton soured cream"
    }
  },
  {
    "_id": "5eb5f9a5f1ca2c9d76d1afa2",
    "index": 3,
    "type": "cake",
    "recipes": {
      "name": "Chocolate cake",
      "recipe": " Heat the oven to 160C/ fan140C/ gas 3. Butter and line a 20cm round cake tin (7.5cm deep). Put 200g chopped dark chocolate in a medium pan with 200g butter. Mix 1 tbsp instant coffee granules into 125ml cold water and pour into the pan. Warm through over a low heat just until everything is melted – don’t overheat. Or melt in the microwave for about 5 minutes, stirring halfway through. Mix 85g self-raising flour, 85g plain flour, ¼ tsp bicarbonate of soda, 200g light muscovado sugar, 200g golden caster sugar and 25g cocoa powder, and squash out any lumps. Beat 3 medium eggs with 75ml buttermilk. Pour the melted chocolate mixture and the egg mixture into the flour mixture and stir everything to a smooth, quite runny consistency. Pour this into the tin and bake for 1hr 25 – 1hr 30 mins. If you push a skewer into the centre it should come out clean and the top should feel firm (don’t worry if it cracks a bit). Leave to cool in the tin (don’t worry if it dips slightly), then turn out onto a wire rack to cool completely. Cut the cold cake horizontally into three. To make the ganache, put 200g chopped dark chocolate in a bowl.  Pour 300ml double cream into a pan, add 2 tbsp golden caster sugar and heat until it is about to boil.Take off the heat and pour it over the chocolate. Stir until the chocolate has melted and the mixture is smooth. Cool until it is a little thicker but still pourable. Sandwich the layers together with just a little of the ganache. Pour the rest over the cake letting it fall down the sides and smooth over any gaps with a palette knife. Decorate with 50g grated chocolate or 100g chocolate curls. The cake keeps moist and gooey for 3-4 days.",
      "ingredients": "200g dark chocolate (about 60% cocoa solids), chopped, 200g butter cubed, 1 tbsp instant coffee granules, 85g self-raising flour, 85g plain flour, ¼ tsp bicarbonate of soda, 200g light muscovado sugar, 200g golden caster sugar, 25g cocoa powder, 3 medium eggs, 75ml buttermilk, 50g grated chocolate or 100g curls, to decorate"
    }
  },
  {
    "_id": "5eb5f9a5a24ea2f2c62259e7",
    "index": 4,
    "type": "cake",
    "recipes": {
      "name": "Sponge Cake",
      "recipe": " Heat oven to 180C/160C fan/gas 4, butter and line the base of two 20cm spring-form cake tins with baking parchment. Using an electric whisk beat the butter and sugar together until pale and fluffy. Crack the eggs in one at a time and whisk well, scraping down the sides of the bowl after each addition. Add the lemon zest, vanilla, flour, milk and a pinch of salt. Whisk until just combined then divide the mixture between the two tins. Bake in the centre of the oven for 25-30 mins until a skewer inserted into the middle of each cake comes out clean. After 10 mins remove the cakes from their tins and leave to cool completely on a wire rack. Fill how you like. My personal favourite is a good dollop of lemon curd and some fresh cream, then dust the top with icing sugar. Will keep for 3 days.",
      "ingredients": "225g softened butter, 225g golden caster sugar, 4 large eggs, 1 tsp vanilla extract, 225g self-raising flour, splash of milk, optional fillings of lemon curd, jam, lightly whipped crea, icing sugar for dusting"
    }
  },
  {
    "_id": "5eb5f9a5f88b049e1fd6f6bf",
    "index": 5,
    "type": "cake",
    "recipes": {
      "name": "Carrot Cake",
      "recipe": " Heat the oven to 180C/fan160C/gas 4. Oil and line the base and sides of an 18cm square cake tin with baking parchment. Tip 175g light muscovado sugar, 175ml sunflower oil and 3 large beaten eggs into a big mixing bowl. Lightly mix with a wooden spoon. Stir in 140g grated carrots, 100g raisins and grated zest of 1 large orange. Sift 175g self-raising flour, 1 tsp bicarbonate of soda, 1 tsp ground cinnamon and ½ tsp grated nutmeg into the bowl. Mix everything together, the mixture will be soft and almost runny. Pour the mixture into the prepared tin and bake for 40-45 mins or until it feels firm and springy when you press it in the centre. Cool in the tin for 5 mins, then turn it out, peel off the paper and cool on a wire rack. (You can freeze the cake at this point if you want to serve it at a later date.) Beat 175g icing sugar and 1½ - 2 tbsp orange juice in a small bowl until smooth – you want the icing about as runny as single cream. Put the cake on a serving plate and boldly drizzle the icing back and forth in diagonal lines over the top, letting it drip down the sides.",
      "ingredients": " 175g light muscovado sugar, 175ml sunflower oil, 3 large eggs, lightly beaten, 140g grated carrot (about 3 medium), 100g raisins, grated zest of 1 large orange, 175g self-raising flour, 1 tsp bicarbonate of soda, 1 tsp ground cinnamon, ½ tsp grated nutmeg (freshly grated will give you the best flavour)"
    }
  },
  {
    "_id": "5eb5f9a5f88b049e1fd6f6bmmf",
    "index": 0,
    "type": "not-cake",
    "recipes": {
      "name": "Absolutely not a cake",
      "recipe": "Recipe of totally not a cake",
      "ingredients": " Ingredients which are absolutely unusable in cakes, therefore, this is defo not a cake"
    }
  }
]
